{
    "buildings": {
        "CAA Building": {
            "title": "CAA Building | College of Agriculture and Agri-Industries",
            "description": "The CAA Building is the heart of agriculture education, where future leaders in agriculture will be trained to become key contributors to the Philippine economy. The college offers two primary programs. The college is dedicated to nurturing innovative farmers who will play a vital role in optimizing the use of the Philippines' agricultural resources.",
            "offered_programs": [
                {
                    "program": "Bachelor of Science in Agriculture",
                    "details": [
                        "Specialization in Crop Science",
                        "Specialization in Agricultural Economics",
                        "Specialization in Agronomy",
                        "Specialization in Soil Science",
                        "Specialization in Agribusiness Management",
                        "Specialization in Animal Science",
                        "Specialization in Horticulture"
                    ]
                },
                {
                    "program": "Bachelor of Science in Agricultural Technology",
                    "details": []
                }
            ],
            "contact_details": [
                "caa@carsu.edu.ph",
                "@csucaaofficial"
            ],
            "opening_hours": "8 AM to 5 PM",
            "wifi": "Available",
            "nearby_locations": "CAA Cafeteria, Main Gate, IWAG Bldg."
        },
        "Iwag Building": {
            "title": "IWAG Building | College of Education",
            "description": "The home of future educators, the torchbearers of the country's hope. As its name suggests, 'Iwag' means light, symbolizing the role of educators in guiding and nurturing the future. Without teachers, there can be no future, as they shape and empower the next generation. They are our guiding grace.",
            "offered_programs": [
                {
                    "program": "Bachelor of Elementary Education",
                    "details": []
                },
                {
                    "program": "Bachelor of Secondary Education",
                    "details": [
                        "Major in Filipino",
                        "Major in English",
                        "Major in Science",
                        "Major in Mathematics"
                    ]
                }
            ],
            "contact_details": [
                "caa@carsu.edu.ph",
                "@csucaaofficial"
            ],
            "opening_hours": "8 AM to 5 PM",
            "wifi": "Available",
            "nearby_locations": "CED Cafeteria, Main Gate, CAA Bldg."
        },
        "Villares Building": {
            "title": "Villares Building | College of Forestry and Environmental Sciences",
            "description": "The Villares Building serves as a hub for the College of Forestry and Environmental Sciences (CoFES), providing a space for teaching and learning that is closely connected to nature. Conveniently located near CSU’s farm and forests, this building plays a vital role in preparing students to manage forests, natural resources, and environmental systems effectively.The college is dedicated to fostering a generation of environmentally conscious leaders, researchers, and professionals who are committed to ensuring the sustainable use of resources, the protection of ecosystems, and a healthier planet for future generations.",
            "offered_programs": [
                "Bachelor of Science in Environmental Science",
                "Bachelor of Science in Agroforestry",
                "Bachelor of Science in Forestry"
            ],
            "contact_details": [
                "cofes@carsu.edu.ph"
            ],
            "opening_hours": "8 AM to 5 PM",
            "wifi": "Available",
            "nearby_locations": "DOST Bldg"
        },
        "Back Admin Building": {
            "title": "Motorpool Building and Back Admin Building",
            "description": "This facility serves as a vital hub for university administrative operations and logistical support. The primary purpose of the building is to accommodate administrative staff and facilitate the processing of essential paperwork. \n In addition to its administrative functions, the Motorpool section of the building houses important university vehicles. These vehicles are frequently utilized by the Agriculture and Engineering departments for fieldwork and other specialized activities. \nAt the rear of the building, a few lecture rooms are situated, primarily dedicated to hosting classes for engineering subjects. These spaces provide an environment conducive to focused learning and technical discussions.",
            "opening_hours": "",
            "wifi": "",
            "nearby_locations": ""
        },
        "CSU's Oval": {
            "title": "CSU Oval",
            "description": "The CSU Oval is a vast, open field that serves as the heart of outdoor activities and events on campus. Primarily used for field sports, it is a hub for athletic training and competitions. Beyond sports, the oval transforms into a vibrant venue for major university events, including the League of Campus Organizations (LCO) gatherings and the prestigious SANGKA, a highlight of CSU’s annual celebrations. With its spacious layout and dynamic usage, the CSU Oval is a central space for fostering camaraderie, showcasing talent, and celebrating the university’s traditions.",
            "offered_programs": [],
            "contact_details": [],
            "opening_hours": "",
            "wifi": "",
            "nearby_locations": ""
        },
        "Hinang Building": {
            "title": "HINANG Hall | College of Engineering and GeoSciences",
            "description": "HINANG Hall is the foundation for the future engineers of Caraga and the nation. Derived from the word 'hinang,' which means 'to make' or 'to do,' the name reflects the spirit of creation, innovation, and action. This building proudly houses the College of Engineering and GeoSciences, nurturing the future builders, problem-solvers, and visionaries of the country. With its vibrant community and a strong population of engineering students, HINANG Hall is known as the 'Home of Champions' for its tradition of excellence. It serves as a ground for honing skills, fostering innovation, and shaping the leaders who will build a better tomorrow.",
            "offered_programs": [
                "Bachelor of Science in Agricultural and Biosystems Engineering",
                "Bachelor of Science in Civil Engineering",
                "Bachelor of Science in Electronics Engineering",
                "Bachelor of Science in Geodetic Engineering",
                "Bachelor of Science in Mining Engineering",
                "Bachelor of Science in Geology"
            ],
            "contact_details": [
                "(085) 341 2296",
                "cegs@carsu.edu.ph",
                "@csucegs"
            ],
            "opening_hours": "8 AM to 5 PM",
            "wifi": "Available",
            "nearby_locations": "HIRAYA Bldg, MASAWA Bldg, Eco Hall, Eco Park"
        },
        "Hiraya Building": {
            "title": "HIRAYA Hall | College of Computing and Information Sciences",
            "description": "HIRAYA Hall embodies the meaning of 'the fruit of one's hope, dreams, and inspiration.' As a testament to Caraga State University's commitment to digital innovation and technological advancement, this building serves as the home of the College of Computing and Information Sciences (CCIS). The college is dedicated to nurturing the future workforce of the tech industry, equipping students with the skills and knowledge needed to shape the rapidly evolving ICT era. HIRAYA Hall stands as a beacon of progress, innovation, and the fulfillment of aspirations in the digital age.",
            "offered_programs": [
                "Bachelor of Science in Computer Science",
                "Bachelor of Science in Information Systems",
                "Bachelor of Science in Information Technology"
            ],
            "contact_details": [
                "ccis@carsu.edu.ph"
            ],
            "opening_hours": "8 AM to 5 PM",
            "wifi": "Available",
            "nearby_locations": "HINANG Hall, MASAWA Bldg, Eco Hall, Eco Park"
        },
        "Hostel Building": {
            "title": "Hostel Building",
            "description": "The Hostel Building is a multi-functional facility that serves as an official lodging space for visitors, providing comfortable accommodations for guests of the university. Additionally, the building houses the university's Clinic, ensuring accessible healthcare services, and the offices for the Physical Education Department, supporting students' health and fitness programs. Outside the Hostel Building, the grounds come alive with activity as Sepak Takraw and Volleyball players practice and play, fostering a vibrant and active campus environment.",
            "opening_hours": "8 AM to 5 PM",
            "wifi": "Not Available",
            "nearby_locations": "BATOK Hall, IWAG Hall, H.E.R.O Learning Commons"
        },
        "Kinaadman Building": {
            "title": "Kinaadman Building",
            "description": "Kinaadman Building derives its name from the word 'kinaadman,' meaning knowledge and wisdom. This building embodies the pursuit of intellectual growth and enlightenment. It serves as a hub for students engaging in the study of humanities and mathematics, fostering an environment of critical thinking and learning.The first floor houses the Mathematics Department's offices and lecture rooms dedicated to mathematics courses. The second floor is home to the Psychology Department's offices and lecture rooms for humanities subjects, providing a space for students to explore the depth of human understanding and interdisciplinary connections.",
            "opening_hours": "8 AM to 5 PM",
            "wifi": "Not Available",
            "nearby_locations": "HIRAYA Bldg, MASAWA Bldg, Eco Hall, Eco Park, Old and New Admin Building"
        },
        "Library Building": {
            "title": "H.E.R.O Learning Commons | CSU Library Building",
            "description": "The H.E.R.O Learning Commons stands as a beacon of knowledge and innovation, recognized in 2021 as the largest library in Mindanao. This impressive three-story structure offers a wide array of facilities, including discussion rooms, comfortable sofas, benches, nap pads, a state-of-the-art ICT area, and a spacious auditorium. Designed to cater to diverse learning needs, the H.E.R.O Learning Commons provides a modern and welcoming environment for collaborative learning, quiet study, and community engagement, embodying CSU’s commitment to academic excellence and student support.",
            "contact_details": [
                "csulibrary@carsu.edu.ph"
            ],
            "opening_hours": "8 AM to 8 PM",
            "wifi": "Available",
            "nearby_locations": "BATOK Hall, IWAG Hall, CAA Building, CSU Oval"
        },
        "Masawa Building": {
            "title": "MASAWA Hall",
            "description": "MASAWA Hall derives its name from the historic island and boat, symbolizing the 'bright light of Butuan.' True to its name, this building represents hope and enlightenment, paving the way for academic excellence and future advancements. Originally designed to house the College of Medicine—an ambitious and visionary project still in the planning stages—MASAWA Hall now serves a dual purpose. \nWhile awaiting the full implementation of the medical program, the hall temporarily functions as a vital academic space, providing lecture rooms for engineering students and humanities subjects. Its bright, modern architecture stands as a testament to CSU's commitment to growth and its dedication to preparing for future milestones in education and innovation.",
            "opening_hours": "24 Hours",
            "wifi": "Available",
            "nearby_locations": "HIRAYA Hall, HINANG Hall, Kinaadman Hall"
        },
        "New Admin Building": {
            "title": "New Admin Building",
            "description": "The New Admin Building serves as the central hub for the university's administrative operations. Designed to accommodate the growing needs of the institution, it houses the offices of key university officials and administrative staff. With its modern facilities and strategic design, the building supports efficient governance and provides a welcoming space for students, faculty, and visitors seeking administrative services.",
            "opening_hours": "8 AM to 5 PM",
            "wifi": "Available",
            "nearby_locations": "Old Admin Building, BATOK Hall, H.E.R.O. Learning Commons, Hostel Building, Back Admin Building"
        },
        "Batok Building": {
            "title": "Batok Hall | College of Mathematics and Natural Sciences",
            "description": "The Batok Hall stands as a pillar of resilience and innovation, housing the Mathematics and Natural Sciences. Much like its name, which symbolizes the back of the neck, the building represents the strength and support that mathematical and scientific disciplines provide to the academic and research community. Equipped with state-of-the-art laboratories and collaborative learning spaces, Batok Building is a hub for discovery, analysis, and the pursuit of knowledge that sustains the CARAGA region and beyond.",
            "offered_programs": [
                "Bachelor of Science in Biology",
                "Bachelor of Science in Chemistry",
                "Bachelor of Science in Physics",
                "Bachelor of Science in Mathematics",
                "Bachelor of Science in Applied Mathematics"
            ],
            "contact_details": [
                "cmns@carsu.edu.ph"
            ],
            "opening_hours": "8 AM to 5 PM",
            "wifi": "Available",
            "nearby_locations": "H.E.R.O. Learning Commons, New Admin Building, IWAG Hall, Hostel Building"
        },
        "Old Admin Building": {
            "title": "Old Admin Building",
            "description": "The Old Admin Building once served as the central hub for the University's administration. Today, it has been repurposed to support student services and organizations. It now houses the University Student Government, the League of Community Organizations (LCO), and the Guidance Office. This transformation has turned the building into an administrative center for student governance and engagement, fostering leadership, collaboration, and support for the university's vibrant student body.",
            "opening_hours": "8 AM to 5 PM",
            "wifi": "Not Available",
            "nearby_locations": "Kinaadman Building, New Admin Building, Old CAS Building"
        },
        "Old CAS Building": {
            "title": "Old CAS Building | College of Humanities and Social Sciences",
            "description": "The Old CAS Building serves as the historic home of the College of Humanities and Social Sciences (CHASS). Within its walls are the offices of the CHASS faculty and staff, as well as the headquarters of the college's Local Student Government, fostering a collaborative and supportive academic environment. Although modest in size, the building includes a few lecture rooms that host humanities subjects, continuing its role as a space for intellectual growth and cultural exploration.",
            "offered_programs": [
                "Bachelor of Science in Social Work",
                "Bachelor of Science in Psychology",
                "Bachelor of Arts in Sociology"
            ],
            "contact_details": [
                "chass@carsu.du.ph",
                "342-0326 LOC. 152",
                "@csuchass"
            ],
            "opening_hours": "8 AM to 5 PM",
            "wifi": "Not Available",
            "nearby_locations": "HIRAYA Hall, HINANG Hall, Kinaadman Hall, Old Admin Building, Eco Park, Eco Hall"
        }
    }
}
