{
    "facts": [
        "Did you know that Caraga State University, founded in 1918 as Agusan Agriculture High School, is now one of the region's leading educational institutions?",
        "Caraga State University spans an incredible 232 hectares! That's more room for learning, growth, and success!",
        "Once known as Northern Mindanao Agricultural College (NORMINAC), CSU has come a long way!",
        "CSU is home to 7 vibrant colleges, each contributing to the university's diverse and dynamic environment!",
        "Right in front of CSU’s library, you'll find the statue of Honorable Elisa Rosales Ochoa, the Philippines' first congresswoman!",
        "CSU boasts a remarkable 100% passing rate for the Electronics Engineer and Electronics Technician Board Exams—now that’s excellence!",
        "Did you know that CSU has an impressive 99.02% passing rate for the Social Work Licensure Exam? That's top-tier performance!",
        "CSU’s future educators are just as impressive—98.84% passing rate for Bachelor of Elementary Education!",
        "Our future high school educators are doing just as great with an 88.67% passing rate for Bachelor of Secondary Education!",
        "In 2024, CSU achieved an outstanding 82.35% passing rate for the Geologist Computer-Based Licensure Exam!",
        "This year, CSU achieved an impressive 82.28% passing rate for the Psychometrician Examination!",
        "CSU also earned a fantastic 75.90% passing rate for the Geodetic Engineers Licensure Exam!",
        "We’re proud to share that CSU’s Mining Engineers Licensure Exam passing rate this year is 72.88%!",
        "CSU continues to shine with a strong 67.03% passing rate for the Forester Licensure Exam!",
        "CSU’s Chemical Technician Licensure Examination passing rate stands at an impressive 66.67% this year!",
        "With an outstanding 64.23% passing rate for the Agriculturist Licensure Examination, CSU is making waves!",
        "Currently, CSU’s Electronics Engineering Licensure Examination passing rate is an impressive 60.87%!",
        "CSU is also excelling in Agricultural and Biosystems Engineering with a solid 57.30% passing rate!",
        "While CSU’s Chemist Licensure Examination passing rate currently stands at 40%, we’re working hard to improve it even further!"
    ]
}
